{
  "basics": {
    "name": "Jason Raimondi",
    "label": "Senior Software Engineer",
    "picture": "https://jasonraimondi.com/misc/me/avatar-2021.jpg",
    "email": "resume@raimondi.us",
    "website": "https://jasonraimondi.com",
    "summary": "Hi, I'm Jason — a versatile Full Stack Engineer crafting web solutions since 2007. From PHP to TypeScript and beyond, I've tackled diverse tech stacks while evolving from spaghetti 🍝 code to scalable architectures. Passionate about clean design, thorough testing, and performance across any language.",
    "location": {
      "city": "Tampa Bay",
      "countryCode": "US",
      "region": "Florida"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "jasonraimondi",
        "url": "https://github.com/jasonraimondi"
      },
      {
        "network": "LinkedIn",
        "username": "jasonraimondi",
        "url": "https://www.linkedin.com/in/jasonraimondi/"
      }
    ]
  },
  "work": [
    {
      "company": "__ Stamped.io",
      "position": "Senior Software Engineer",
      "website": "https://stamped.io/",
      "startDate": "2024-05-01",
      "endDate": "present",
      "summary": "Stamped is an all-in-one platform that collects authentic customer reviews, builds loyalty programs, and encourages repeat ordering to boost e-commerce growth.",
      "highlights": [
        "Retrofitted our Shopify Embedded App with a standalone Admin Experience for shop impersonation capabilities, reducing CSM troubleshooting time and substantially enhancing first-call resolution rates.",
        "Built Shopify Checkout Extension that boosted opt-in conversion rates through intuitive UI/UX and streamlined authentication flow.",
        "Handled critical infrastructure migrations including Sidekiq to AWS SQS job queue architecture and Ruby v3 upgrade for core Rails application, achieving reduced memory consumption, increased throughput for peak loads, and significant performance improvements with zero downtime deployment.",
        "Engineered a flexible product bundle organization system enabling brands to customize promotion strategies (full bundles vs. individual components), expanding platform compatibility across diverse product categories and driving repeat purchases for newly onboarded brands"
      ]
    },
    {
      "company": "Repeat (acquired by Stamped.io)",
      "position": "Senior Software Engineer",
      "website": "https://www.getrepeat.io/",
      "startDate": "2022-06-01",
      "endDate": "2024-05-01",
      "summary": "Repeat boosts repurchase rate by automatically delivering personalized messaging at high-leverage Moments",
      "highlights": [
        "Launched Repeat's first self-serve Shopify Public App, eliminating manual onboarding bottlenecks and significantly reducing customer support dependencies while accelerating time-to-value for new users.",
        "Fast-tracked our Klaviyo partnership by quickly adopting their new OAuth API standard in our Rails backend, earning us early access to their developer program and placement in Klaviyo's official integration catalog. Leveraged newly available bulk endpoints to build features competitors couldn't match, expanding our product capabilities.",
        "Engineered a GraphQL architecture for our Rails API, enabling automatic client library generation that accelerated frontend development cycles. This pattern eliminated tedious manual API integration work, allowing the team to ship user-facing features significantly faster.",
        "Expanded the Repeat Shopping Cart with subscription support, enabling users to seamlessly combine one-time purchases and recurring products in a single transaction.",
        "Strengthened product reliability by implementing comprehensive Cypress end-to-end testing for our Shopify Public App, reducing the likelyhood of production issues while establishing automated quality standards.",
        "Transformed legacy Express codebase into a modular NestJS architecture, improving maintainability, testability, and developer experience while delivering a more stable foundation for our Shopify Public App."
      ]
    },
    {
      "company": "HitRECord",
      "position": "Senior Software Engineer",
      "website": "https://web.archive.org/web/20220730210219/https://hitrecord.org/",
      "startDate": "2019-04-01",
      "endDate": "2022-05-01",
      "summary": "HitRecord was an online community founded by Joseph Gordon-Levitt in 2005 where creators can come and jam together on films, music, writing, and art.",
      "highlights": [
        "Engineered a comprehensive GitOps pipeline using Terraform for EKS cluster provisioning and resource management, complemented by custom Helm charts and FluxCD for application deployment, creating a fully version-controlled infrastructure pipeline that eliminated environment drift and enabled self-service deployments.",
        "Migrated a monolithic Ruby on Rails application to a containerized microservice architecture on EKS, implementing Kubernetes-native autoscaling that dynamically allocates resources based on real-time traffic patterns.",
        "Developed an automated system creating isolated review environments for each merge request, enabling focused QA testing that transformed our deployment cadence from bi-weekly releases to continuous deployment.",
        "Transformed legacy \"spaghetti\" AngularJS/Rails monolith to a modern Angular SPA with Rails API backend, organizing a clear separation of concerns that improved code maintainability.",
        "Slashed E2E testing time from over an hour to less than 10 minutes by replacing legacy Capybara/Selenium test suite with Cypress, enabling faster feedback cycles and removing a major bottleneck from the development process."
      ]
    },
    {
      "company": "Event Farm",
      "position": "Software Engineer",
      "website": "https://eventfarm.com",
      "startDate": "2016-02-01",
      "endDate": "2019-03-01",
      "summary": "Event Farm is a suite of event engagement tools designed to promote brands, grow your business, and engage targeted audiences at in-person events.",
      "": "__ Promoted to Senior Software Engineer 2018-09-01, leaving this here for history, but removing that as a separate entry",
      "highlights": [
        "Built a full-featured WYSIWYG event landing page builder called [Event Farm \"Canvas\"](https://player.mux.com/Mg3udXiDYIb3cciApQyj5z1c00p01Y9EPtWPJ16aYldWU) with the ability to start from scratch or use a pre-designed templates, eliminating the 2-3 day wait for in-house designers to implement updates and enabling event managers to instantly create and modify pages themselves",
        "Engineered a seamless Salesforce-Event Farm integration that instantly updated lead and contact records based on real-time event attendance and NFC interaction data, reducing manual CRM updates and enabling personalized post-event follow-up within hours instead of days",
        "Open-sourced a [PHP 7 Salesforce Rest API](https://github.com/eventfarm/restforcephp) that simplified complex Salesforce integrations and was used by organizations beyond Event Farm",
        "Created **auto-generating** middleware SDKs in [Golang](https://github.com/eventfarm/go-sdk) and [Node.js](https://github.com/eventfarm/javascript-sdk) that abstracted REST API complexity, empowering both in-house and third-party developers with a streamlined development experience",
        "Modernized a brittle PHP 5 CakePHP monolith by architecting a clean, modular PHP 7 API with clear domain boundaries, implementing automated testing strategies that achieved 85%+ code coverage and enabled confident refactoring of business-critical functionality.",
        "Migrated a legacy AngularJS application to the current Angular framework, enhancing both developer and user experience through improved reliability and responsiveness."
      ]
    },
    {
      "company": "Recovery Passport",
      "position": "Full Stack Web Developer",
      "website": "https://www.linkedin.com/company/recovery-passport/about/",
      "startDate": "2015-11-10",
      "endDate": "2017-04-26",
      "summary": "Recovery Passport is a recovery assistance and journalizing system used by alcohol and mental health recovery patients at several clinics around South Florida.",
      "highlights": [
        "Designed and developed a web-based journaling system for alcohol and mental health recovery clinics, employing Laravel, MySQL, and Vue.js. The application was built to streamline therapy processes and enhanced patient engagement with their counselors and supporters.",
        "Sustained a Minimum Viable Product that served approximately 1,000 patients across multiple clinics in South Florida, demonstrating its real-world utility and positive impact on mental health recovery.",
        "Implemented containerized deployment architecture using Docker on Digital Ocean, streamlining application management while ensuring consistent and reliable runtime environments across development stages."
      ]
    },
    {
      "company": "__ Digital Canvas Design LLC",
      "position": "Owner / Consultant",
      "startDate": "2014-01-01",
      "endDate": "2020-05-01",
      "highlights": [
        "Designed and built [Recovery Passport](https://www.linkedin.com/company/recovery-passport/about/), a three-tiered recovery assistance system with counselors, members, and supporters, used by ~1000 alcohol and mental health recovery patients at several clinics around South Florida.",
        "Maintained custom web applications in PHP, Ruby, Nodejs, and Golang for clients with varying complexity.",
        "Provided infrastructure build out, web hosting, and custom server builds and installations."
      ]
    },
    {
      "company": "Web Services LLC",
      "position": "Full Stack Web Developer",
      "website": "https://www.linkedin.com/company/web-services-llc/about/",
      "startDate": "2014-06-01",
      "endDate": "2015-11-01",
      "summary": "Web Services was a web agency in South Florida that serviced ",
      "highlights": [
        "Maintained bare metal web hosting infrastructure using LEMP stack (Linux, Nginx, MySQL, PHP), implementing custom deployment scripts and server hardening protocols to ensure consistent performance and security while supporting growing user traffic.",
        "Built an analytics MVP that helped advertising agencies correlate TV airtime with customer engagement metrics across web, SMS, and social media channels, delivering actionable ROI insights.",
        "Engineered multiple PHP applications and web scraping systems that transformed public datasets into engaging web features like pet adoption and restaurant health inspection reports."
      ]
    },
    {
      "company": "ACE Blueprinting & Graphics",
      "position": "Graphic Designer",
      "website": "https://web.archive.org/web/20140516214736/http://aceblueprinting.com/",
      "startDate": "2011-05-01",
      "endDate": "2014-01-01",
      "summary": "At ACE Blueprinting & Graphics, I executed a range of graphic projects, taking responsibility for the full design lifecycle, from concept creation to the final print.",
      "highlights": [
        "Executed a range of graphic design projects through complete lifecycles, conceptualizing and executing deliverables using Illustrator and Photoshop while collaborating across teams to meet critical deadlines.",
        "Engineered and built high-performance custom PC workstations optimized for graphic processing, reducing render times by 40% and implementing a streamlined print server architecture that eliminated workflow bottlenecks."
      ]
    },
    {
      "company": "Florida Sea Grant",
      "position": "Web Developer - Contract",
      "website": "https://web.archive.org/web/20120621080013/http://www.sarasotabaysurvey.org/",
      "startDate": "2012-04-01",
      "endDate": "2012-07-01",
      "summary": "At the Florida Sea Grant, I collaborated with two Ph.D. candidates to gather data used for community research on the Sarasota Bay and the Ace Basin.",
      "highlights": [
        "Built a online survey platform using PHP, MySQL and Google Maps API that enabled PhD researchers to gather critical environmental impact metrics across [Florida]((https://web.archive.org/web/20120621080013/http://www.sarasotabaysurvey.org/)) and [South Carolina](https://web.archive.org/web/20130921231828/http://acebasinsurvey.org/) waterways, resulting in comprehensive public sentiment analysis for conservation decision-making."
      ]
    },
    {
      "company": "Student Game Day LLC",
      "position": "Web Designer",
      "website": "https://web.archive.org/web/20080917053305/http://www.studentgameday.com/",
      "startDate": "2008-06-01",
      "endDate": "2009-12-01",
      "summary": "At Student Game Day LLC, a tool for selling student college football tickets, I assisted in the design and HTML/CSS of a custom-built web app using procedural PHP",
      "highlights": [
        "Contributed to the design and HTML/CSS of a custom-built web app for selling student college football tickets, built with procedural PHP."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Florida",
      "area": "Digital Media",
      "studyType": "Bachelor of Fine Arts",
      "endDate": "2013-08-01",
      "courses": [
        "Programming for Artists",
        "3D Modeling",
        "Video Art",
        "Game Design",
        "Color Theory",
        "Typography"
      ]
    }
  ],
  "publications": [
    {
      "name": "typescript-oauth2-server",
      "releaseDate": "2023-07-01",
      "website": "https://github.com/jasonraimondi/typescript-oauth2-server",
      "summary": "An implementation of an OAuth 2.0 authorization server for Node that utilizes JWT and Proof Key for Code Exchange (PKCE), written in TypeScript."
    },
    {
      "name": "promise-watch",
      "releaseDate": "2022-03-01",
      "website": "https://github.com/promise-watch/promise-watch",
      "summary": "An API/E2E monitor that runs promises on intervals and sends notifications on errors."
    },
    {
      "name": "url-to-png",
      "releaseDate": "2018-08-01",
      "website": "https://github.com/jasonraimondi/url-to-png",
      "summary": "Dynamic screenshots for the web over a simple HTTP API."
    },
    {
      "name": "traverse",
      "releaseDate": "2019-04-09",
      "website": "https://github.com/jasonraimondi/traverse",
      "summary": "Desktop app to explore trending GitHub repos (Mac OS/Linux)."
    }
  ],
  "skills": [
    {
      "name": "Frontend",
      "keywords": [
        "TypeScript/JavaScript",
        "Angular/React/Svelte/Vue",
        "HTML5/CSS",
        "Cypress E2E Testing",
        "Jest/Vitest Unit Testing",
        "GraphQL Clients",
        "SPA Architecture"
      ]
    },
    {
      "name": "Backend",
      "keywords": [
        "Node.js (NestJS, Express)",
        "Ruby on Rails",
        "PHP 7+ (Laravel, CakePHP)",
        "GraphQL",
        "REST",
        "OAuth/Authentication",
        "Microservice Architecture",
        "SQL/MySQL",
        "Message Queues (SQS, Sidekiq)",
        "Domain-Driven Design",
        "Test-Driven Development"
      ]
    },
    {
      "name": "Devops",
      "keywords": [
        "Kubernetes/EKS",
        "Terraform",
        "GitOps (FluxCD)",
        "AWS Cloud Services",
        "CI/CD Pipelines",
        "Docker/Containerization",
        "Helm Charts",
        "Infrastructure as Code",
        "Review Environments",
        "Autoscaling",
        "Monitoring/Observability"
      ]
    }
  ]
}
