{
  "basics": {
    "name": "Jason Raimondi",
    "label": "Software Engineer",
    "picture": "https://jasonraimondi.com/misc/me/avatar.jpg",
    "email": "jason@raimondi.us",
    "phone": "(954) 703-0436",
    "website": "https://jasonraimondi.com",
    "summary": "My name is Jason Raimondi and I am a Full Stack Software Engineer. My professional focus has been in web systems; everything from designing to building and deploying server and client web applications. What I really am is a technologist and all around computer geek. Give me a computer and I will be hacking in minutes, occupied for days.",
    "location": {
      "city": "Los Angeles",
      "countryCode": "US",
      "region": "California"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "jasonraimondi",
        "url": "https://www.linkedin.com/in/jasonraimondi/"
      },
      {
        "network": "GitHub",
        "username": "jasonraimondi",
        "url": "https://github.com/jasonraimondi"
      }
    ]
  },
  "work": [
    {
      "company": "HitRECord",
      "position": "Software Engineer",
      "website": "https://hitrecord.org",
      "startDate": "2019-04-01",
      "endDate": "present",
      "highlights": [
        "__ Updated our software release workflow by making it very obvious current environment containing the code change for each ticket s.",
        "__ Deployed our Ruby on Rails application on AWS EKS (k8s), allowing large spikes in traffic by monitoring our puma threads and scaling our infrastructure vertically to additional nodes (and pods).",
        "Automated dynamic review environment creation that allowed QA testing for all incoming merge requests.",
        "Refactored a legacy integration test suite into Cypress with parallelized workers, speeding up average CI test time from 60+ minutes to ~12 minutes.",
        "Decoupled legacy javascript application from a Rails templates to an Angular 8+ SPA."
      ]
    },
    {
      "company": "Digital Canvas Design LLC",
      "position": "Owner, Software Consultant",
      "startDate": "2014-01-01",
      "endDate": "present",
      "summary": "__ I began freelancing in 2009",
      "highlights": [
        "Constructs and manages web applications for clients with varying complexity, from custom-built web applications in the client’s language of choice to simple static HTML sites.",
        "Custom server builds, server installs, infrastructure buildout, web hosting."
      ]
    },
    {
      "company": "Event Farm",
      "position": "Senior Software Engineer",
      "website": "https://eventfarm.com",
      "startDate": "2018-09-01",
      "endDate": "2019-03-01",
      "summary": "__ Event Farm is a marketing platform built for event organizers to plan, market, monitor, and review event data. ",
      "highlights": [
        "Test drove re-architecture of a legacy PHP 5 codebase, decoupling an untested CakePHP 2.x monolith, to a custom PHP 7 API routed through Lumen and an Angular SPA. The project maintained 85%+ code coverage and was built using Domain-Driven Design (DDD) and Command Query Separation (CQS) principles.",
        "Authored middleware client applications built in Golang and Node.js that consumed the Event Farm Rest API. Example applications include a custom event landing page builder for organizers to use so they could create and update , custom event signup flows, and custom event registration pages."
      ]
    },
    {
      "company": "Event Farm",
      "position": "Software Engineer",
      "website": "https://eventfarm.com",
      "startDate": "2016-02-01",
      "endDate": "2018-09-01",
      "summary": "Event Farm is a marketing platform built for event organizers to plan, market, monitor, and review event data. During my time there, I worked on adding features to web platform, including the frontend web client and backend API.",
      "highlights": [
        "Built auto-generating client libraries for the Event Farm API. Clients were generated in PHP, Typescript, Golang, Python, Swift, and Java, and assisted in the consumption of the Event Farm Rest API. Typescript and Golang libraries were opened sourced and are available on GitHub at (eventfarm/javascript-sdk) and (eventfarm/golang-sdk). These client libraries were consumed in the official mobile apps as well as the web application.",
        "Headed a custom integration between Salesforce and Event Farm. The integrations would sync the status of Salesforce Leads and Contacts to event attendees and their event status (accepted, declined, checked-in, etc). Open-sourced the PHP 7 Salesforce Rest API (restforcephp) that we built and used internally for the integrations."
      ]
    },
    {
      "company": "__ Recovery Passport",
      "position": "Full Stack Web Developer",
      "website": "https://www.linkedin.com/company/recovery-passport/about/",
      "startDate": "2015-11-10",
      "endDate": "2017-04-26",
      "summary": "Recovery Passport was a three tiered system with counselors, members, and supporters, and was used by alcohol and mental health recovery clinics around South Florida. Members were able to add journals or goals, and were asked to check in daily. Counselors could monitor and comment on the members status, and supporters could see and comment on public journals of their members.",
      "highlights": [
        "Built a Laravel 5.x MVP that was used by ~1000 users over 15 facilities in Florida."
      ]
    },
    {
      "company": "Web Services LLC",
      "position": "Full Stack Web Developer",
      "website": "https://www.linkedin.com/company/web-services-llc/about/",
      "startDate": "2014-06-01",
      "endDate": "2015-11-01",
      "summary": "__ My primary work at Web Services was creating and maintaining web applications for local news stations located around the country. In addition to these applications, we were developing a tool called AdStat that would monitor CTA's in TV Spots and compare the CTA responses to the commercial airtime. During my time at Web Services, I worked on supporting existing web applications while also working on greenfield development of the AdStat application.",
      "highlights": [
        "Led team of 4 developers building a SaaS Application for Advertising Agencies to monitor ROI and Reactions to TV Campaigns.",
        "__ Maintained LEMP stacks on dedicated private servers.",
        "Built and maintained various PHP MVC applications in an assortment of frameworks, from Code Igniter to Laravel, and FuelPHP. Integrated various web 3rd party services including Google and Twilio into these custom applications.",
        "Redesigned and implemented the update to [WDIV Click on Detroit's “Vote 4 the Best”](https://www.clickondetroit.com/vote-4-the-best/) voting application."
      ]
    },
    {
      "company": "ACE Blueprinting & Graphics",
      "position": "Graphic Designer",
      "website": "https://aceblueprinting.com/",
      "startDate": "2011-05-01",
      "endDate": "2014-01-01",
      "summary": "ACE Blueprinting & Graphics is a local printing shop in Ft. Lauderdale, FL. I worked as a Graphic Design Intern here for several summers, working with clients on print products from design to delivery. In addition to my graphic design work, I also modernized workstations by custom builting several PC's that were used as graphic design stations and others as printservers.",
      "highlights": [
        "Completed graphic projects while collaborating with clients, designing vector and raster graphics using Illustrator and Photoshop from concept to printed works.",
        "Built custom PC workstations serving as state-of-the-art graphic editing stations and custom print servers."
      ]
    },
    {
      "company": "Florida Sea Grant",
      "position": "Front End Developer",
      "website": "https://web.archive.org/web/20120621080013/http://www.sarasotabaysurvey.org/",
      "startDate": "2012-04-01",
      "endDate": "2012-07-01",
      "summary": "__ Collaborated with two Ph.D. candidates to gather data that was used to research community uses of the Sarasota Bay and the Ace Basin.",
      "highlights": [
        "Authored a PHP + jQuery + Google Maps-based interactive survey to gather data on the [Sarasota Bay](https://web.archive.org/web/20120621080013/http://www.sarasotabaysurvey.org/) in Florida and the [Ace Basin](https://web.archive.org/web/20130921231828/http://acebasinsurvey.org/) in South Carolina."
      ]
    },
    {
      "company": "Student Game Day LLC",
      "position": "Web Designer",
      "website": "https://web.archive.org/web/20080917053305/http://www.studentgameday.com/",
      "startDate": "2008-06-01",
      "endDate": "2009-12-01",
      "highlights": [
        "Assisted the design and HTML/CSS of a custom built web app for selling student college football tickets built in old-school procedural PHP."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Florida",
      "area": "Digital Media",
      "studyType": "Bachelor of Fine Arts",
      "endDate": "2013-08-01",
      "courses": [
        "Video Art",
        "Programming for Artists",
        "3D Modeling",
        "Game Design",
        "Color Theory",
        "Typography"
      ]
    }
  ],
  "publications": [
    {
      "name": "typescript-oauth2-server",
      "releaseDate": "2020-10-19",
      "website": "https://github.com/jasonraimondi/typescript-oauth2-server",
      "summary": "A standards-compliant implementation of an OAuth 2.0 authorization server for Node that utilizes JWT and Proof Key for Code Exchange (PKCE), written in TypeScript."
    },
    {
      "name": "use-notify-rxjs",
      "releaseDate": "2021-02-17",
      "website": "https://github.com/jasonraimondi/use-notify-rxjs",
      "summary": "Simple, design-free toast notifications using rxjs."
    },
    {
      "name": "url-to-png",
      "releaseDate": "2018-08-01",
      "website": "https://github.com/jasonraimondi/url-to-png",
      "summary": "Dynamic screenshots for the web over a simple http api."
    },
    {
      "name": "locatizor",
      "releaseDate": "2020-03-03",
      "website": "https://github.com/jasonraimondi/locatizor",
      "summary": "Desktop app to add GPS data to jpg's that are missing location (Mac OS/Linux)."
    },
    {
      "name": "traverse",
      "releaseDate": "2019-04-09",
      "website": "https://github.com/jasonraimondi/traverse",
      "summary": "Desktop app for explore trending GitHub repos (Mac OS/Linux)."
    },
    {
      "name": "restforcephp",
      "releaseDate": "2016-11-21",
      "website": "https://github.com/eventfarm/restforcephp",
      "summary": "PHP API client library for Salesforce."
    }
  ],
  "skills": [
    {
      "name": "Front End",
      "keywords": [
        "HTML5",
        "CSS/PostCSS",
        "TypeScript",
        "JavaScript",
        "React",
        "Angular",
        "Electron"
      ]
    },
    {
      "name": "Back End",
      "keywords": [
        "Node.js",
        "TypeScript",
        "Ruby on Rails",
        "PHP 7+",
        "Laravel",
        "OOP",
        "Testing",
        "SQL",
        "OAuth2",
        "REST",
        "GraphQL"
      ]
    },
    {
      "name": "Testing",
      "keywords": [
        "Cypress",
        "Jest",
        "Rspec",
        "PHPUnit"
      ]
    },
    {
      "name": "Devops",
      "keywords": [
        "Docker",
        "Kubernetes",
        "AWS",
        "Pod Autoscaling",
        "Node Autoscaling",
        "CI/CD",
        "GitOPS",
        "Queueing"
      ]
    },
    {
      "name": "Design",
      "keywords": [
        "Photoshop",
        "Illustrator",
        "InDesign",
        "Premier Pro",
        "After Effects",
        "Figma",
        "GIMP"
      ]
    }
  ]
}
