{
  "basics": {
    "name": "Jason Raimondi",
    "label": "Senior Software Engineer",
    "picture": "https://jasonraimondi.com/misc/me/avatar-2021.jpg",
    "email": "resume@raimondi.us",
    "website": "https://jasonraimondi.com",
    "summary": "Hi, I'm Jason. I am a Senior Full Stack Software Engineer. I have been developing for the web since 2007. I’ve worked on everything from old-school procedural monsters, to MVC frameworks, to fully tested domain-driven applications.",
    "location": {
      "city": "Los Angeles",
      "countryCode": "US",
      "region": "California"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "jasonraimondi",
        "url": "https://github.com/jasonraimondi"
      },
      {
        "network": "LinkedIn",
        "username": "jasonraimondi",
        "url": "https://www.linkedin.com/in/jasonraimondi/"
      },
      {
        "network": "__ Polywork",
        "username": "jasonraimondi",
        "url": "https://polywork.com/jasonraimondi"
      }
    ]
  },
  "work": [
    {
      "company": "HitRECord",
      "position": "Senior Software Engineer",
      "website": "https://hitrecord.org",
      "startDate": "2019-04-01",
      "endDate": "2022-05-01",
      "highlights": [
        "Created a system to spin up review environments for open merge requests, allowing QA to manually test and see an isolated environment for all incoming merge requests. This ultimately enabled us to update our deployment schedule from bi/weekly to continuous deployment for each merged pull request.",
        "Migrated a Ruby on Rails application to AWS EKS, allowing us to handle large spikes in traffic. Monitored and autoscaled based on remaining puma threads available.",
        "Decoupled an angular.js application in Rails erb templates to an Angular SPA + Rails API.",
        "Sped up E2E test suite runtime time from over an hour to ~12 minutes by refactoring a legacy integration test suite from Capybara/Selenium to a Cypress."
      ]
    },
    {
      "company": "Event Farm",
      "position": "Senior Software Engineer",
      "website": "https://eventfarm.com",
      "startDate": "2018-09-01",
      "endDate": "2019-03-01",
      "summary": "Event Farm is a marketing platform built for event organizers to plan, market, monitor, and review event data. During my time there, I worked on adding features to web platform, including the frontend web client and backend API.",
      "highlights": [
        "Authored middleware client applications built in Golang and Node.js that consumed the Event Farm Rest API. Example applications include a custom event landing page builder for organizers to use so they could create and update, custom event signup flows, and custom event registration pages.",
        "Built auto-generating client libraries for the Event Farm API. Clients were generated in PHP, Typescript, Golang, Python, Swift, and Java, and assisted in the consumption of the Event Farm Rest API. Typescript and Golang libraries were opened sourced and are available on GitHub at [javascript-sdk](https://github.com/eventfarm/javascript-sdk) and [golang-sdk](https://github.com/eventfarm/go-sdk). These client libraries were consumed in the official mobile apps as well as the web application."
      ]
    },
    {
      "company": "Event Farm",
      "position": "Software Engineer",
      "website": "https://eventfarm.com",
      "startDate": "2016-02-01",
      "endDate": "2018-09-01",
      "highlights": [
        "Test-drove the re-architecture of a legacy PHP 5 codebase. Decoupled an untested CakePHP 2.x monolith, to a tested PHP 7 API and an Angular SPA. The project maintained 85%+ code coverage and was built using Domain-Driven Design (DDD) and Command Query Separation (CQS) principles.",
        "Headed a custom integration between Salesforce and Event Farm. The integrations would sync the status of Salesforce Leads and Contacts to event attendees and their event status (accepted, declined, checked-in, etc). Open-sourced the PHP 7 Salesforce Rest API (restforcephp) that we built and used internally for the integrations.",
        "Contributed to and maintained a CakePHP API and AngularJS/Angular."
      ]
    },
    {
      "company": "Recovery Passport",
      "position": "Full Stack Web Developer",
      "website": "https://www.linkedin.com/company/recovery-passport/about/",
      "startDate": "2015-11-10",
      "endDate": "2017-04-26",
      "highlights": [
        "Solo developer that built web based journaling system for alcohol and mental health recovery clinics using Laravel, MySQL and Vuejs.",
        "Maintained an MVP that was used by ~1000 alcohol and mental health recovery patients at several clinics around South Florida.",
        "Deployed application using Docker on Digital Ocean."
      ]
    },
    {
      "company": "__ Digital Canvas Design LLC",
      "position": "Owner / Consultant",
      "startDate": "2014-01-01",
      "endDate": "2020-05-01",
      "highlights": [
        "Built [Recovery Passport](https://www.linkedin.com/company/recovery-passport/about/), a three-tiered recovery assistance system with counselors, members, and supporters. Built an MVP that was used by ~1000 alcohol and mental health recovery patients at several clinics around South Florida.",
        "Maintained custom web applications in PHP, Ruby, Nodejs, and Golang for clients with varying complexity.",
        "Infrastructure build out, web hosting, custom server builds, server installs."
      ]
    },
    {
      "company": "Web Services LLC",
      "position": "Full Stack Web Developer",
      "website": "https://www.linkedin.com/company/web-services-llc/about/",
      "startDate": "2014-06-01",
      "endDate": "2015-11-01",
      "summary": "At Web Services, I created and maintained embedded web applications for local news station around the country. Applications ranged from adopt-a-pet services to restaurant inspections. I also worked on internal tooling as well as a development on a tv ad tracking service.",
      "highlights": [
        "Built analytics application for advertising agencies that imported and normalized tv commercial buys and compared them against CTA's in the commercials. Integrated various web 3rd party services including Web Analytics, SMS, Social Hashtags to compare against commercial runtimes.",
        "Maintained various PHP MVC applications and web scrapers for local news stations that ranged from adopt-a-pet to restaurant inspections. Applications were built in an assortment of MVC frameworks including Laravel, CodeIgniter, and FuelPHP.",
        "Updated and modernized [WDIV Click on Detroit's “Vote 4 the Best”](https://www.clickondetroit.com/vote-4-the-best/) voting application in from a Laravel 3.x application to Laravel 5.1 LTS."
      ]
    },
    {
      "company": "ACE Blueprinting & Graphics",
      "position": "Graphic Designer",
      "website": "https://aceblueprinting.com/",
      "startDate": "2011-05-01",
      "endDate": "2014-01-01",
      "summary": "ACE Blueprinting & Graphics is a local printing shop in Ft. Lauderdale, FL where I worked as a Graphic Design Intern here for several summers.",
      "highlights": [
        "Completed graphic projects while collaborating with clients, designing vector and raster graphics using Illustrator and Photoshop from concept to printed works.",
        "Built custom PC workstations serving as state-of-the-art graphic editing stations and custom print servers."
      ]
    },
    {
      "company": "Florida Sea Grant",
      "position": "Web Developer - Contract",
      "website": "https://web.archive.org/web/20120621080013/http://www.sarasotabaysurvey.org/",
      "startDate": "2012-04-01",
      "endDate": "2012-07-01",
      "summary": "Collaborated with two Ph.D. candidates to gather data that was used to research community uses of the Sarasota Bay and the Ace Basin.",
      "highlights": [
        "Authored a PHP + jQuery + Google Maps-based interactive survey to gather data on the [Sarasota Bay](https://web.archive.org/web/20120621080013/http://www.sarasotabaysurvey.org/) in Florida and the [Ace Basin](https://web.archive.org/web/20130921231828/http://acebasinsurvey.org/) in South Carolina."
      ]
    },
    {
      "company": "Student Game Day LLC",
      "position": "Web Designer",
      "website": "https://web.archive.org/web/20080917053305/http://www.studentgameday.com/",
      "startDate": "2008-06-01",
      "endDate": "2009-12-01",
      "summary": "Student Game Day was a company/site some friends in college created while attending UF that was a tool to ",
      "highlights": [
        "Assisted the design and HTML/CSS of a custom built web app for selling student college football tickets built in old-school procedural PHP."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Florida",
      "area": "Digital Media",
      "studyType": "Bachelor of Fine Arts",
      "endDate": "2013-08-01",
      "courses": [
        "Video Art",
        "Programming for Artists",
        "3D Modeling",
        "Game Design",
        "Color Theory",
        "Typography"
      ]
    }
  ],
  "publications": [
    {
      "name": "typescript-oauth2-server",
      "releaseDate": "2020-10-19",
      "website": "https://github.com/jasonraimondi/typescript-oauth2-server",
      "summary": "A standards-compliant implementation of an OAuth 2.0 authorization server for Node that utilizes JWT and Proof Key for Code Exchange (PKCE), written in TypeScript."
    },
    {
      "name": "promise-watch",
      "releaseDate": "2022-03-01",
      "website": "https://github.com/promise-watch/promise-watch",
      "summary": "An Api/E2E monitor that runs promises on intervals and sends notifications on errors."
    },
    {
      "name": "url-to-png",
      "releaseDate": "2018-08-01",
      "website": "https://github.com/jasonraimondi/url-to-png",
      "summary": "Dynamic screenshots for the web over a simple http api."
    },
    {
      "name": "traverse",
      "releaseDate": "2019-04-09",
      "website": "https://github.com/jasonraimondi/traverse",
      "summary": "Desktop app for explore trending GitHub repos (Mac OS/Linux)."
    }
  ],
  "skills": [
    {
      "name": "Frontend",
      "keywords": [
        "TypeScript",
        "JavaScript",
        "HTML5/CSS",
        "E2E Testing",
        "Unit Testing",
        "<Insert frontend framework here>"
      ]
    },
    {
      "name": "Backend",
      "keywords": [
        "Node.js",
        "Ruby",
        "PHP 7+",
        "E2E Testing",
        "Unit Testing",
        "OAuth",
        "Object oriented programming",
        "Queues",
        "Relational databases",
        "Document databases",
        "Key-Value databases",
        "<Insert backend framework here>"
      ]
    },
    {
      "name": "Devops",
      "keywords": [
        "Kubernetes",
        "Terraform",
        "GitOps",
        "AWS",
        "Continuous Integration",
        "Continuous Deployment",
        "Autoscaling",
        "Docker"
      ]
    }
  ]
}
