{
  "basics": {
    "name": "Jason Raimondi",
    "label": "Senior Software Engineer",
    "picture": "https://jasonraimondi.com/misc/me/avatar-2021.jpg",
    "email": "resume@raimondi.us",
    "website": "https://jasonraimondi.com",
    "summary": "Hi, I'm Jason. I am a Senior Full Stack Software Engineer with experience in web development since 2007. I have a strong background in developing MVC frameworks and fully tested domain-driven applications. I am passionate about streamlining processes, enhancing test coverage, and improving application performance.",
    "location": {
      "city": "St. Petersburg",
      "countryCode": "US",
      "region": "Florida"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "jasonraimondi",
        "url": "https://github.com/jasonraimondi"
      },
      {
        "network": "LinkedIn",
        "username": "jasonraimondi",
        "url": "https://www.linkedin.com/in/jasonraimondi/"
      }
    ]
  },
  "work": [
    {
      "company": "Repeat",
      "position": "Senior Software Engineer",
      "website": "https://www.getrepeat.io/",
      "startDate": "2022-06-01",
      "endDate": "present",
      "summary": "At Repeat, I focus on streamlining the customer onboarding process, enhancing test coverage, and improving application performance. My role involves extensive work with Shopify apps and Ruby on Rails.",
      "highlights": [
        "Developed and implemented a Ruby on Rails REST API, utilizing rspec for code testing. Enhanced the user experience by enabling seamless onboarding for application consumers, eliminating the need for customer service involvement.",
        "Created a Shopify public app that streamlined customer onboarding. Enabled self-service onboarding capabilities, reducing reliance on customer service.",
        "Implemented an end-to-end testing suite using Cypress for a Shopify embedded app. Increased testing coverage and improved application robustness. Ensured a high-quality user experience and minimized production risks."
      ]
    },
    {
      "company": "HitRECord",
      "position": "Senior Software Engineer",
      "website": "https://web.archive.org/web/20220730210219/https://hitrecord.org/",
      "startDate": "2019-04-01",
      "endDate": "2022-05-01",
      "summary": "At HitRECord, I led the development of various projects aimed at improving efficiency and scalability. I also played a key role in migrating a Ruby on Rails application to AWS EKS and improving the performance of the end-to-end test suite.",
      "highlights": [
        "Migrated a Ruby on Rails application to AWS EKS, allowing us to handle large spikes in traffic. Monitored and autoscaled based on remaining puma threads available.",
        "Developed a system for creating separate review environments for each open merge request, enabling QA to perform focused testing. This change significantly improved our deployment process, shifting us from bi-weekly releases to a continuous deployment.",
        "Successfully orchestrated the decoupling of a legacy Angular.js 1 system from Rails templates, transitioning it into an Angular Single-Page Application (SPA) with a Rails API integration. Demonstrated meticulous attention to detail in conducting comprehensive testing and debugging to guarantee a seamless transition and preemptively eradicate potential issues during the decoupling process.",
        "Sped up E2E test suite runtime time from over an hour to ~12 minutes by refactoring a legacy integration test suite from Capybara/Selenium to Cypress."
      ]
    },
    {
      "company": "Event Farm",
      "position": "Senior Software Engineer",
      "website": "https://eventfarm.com",
      "startDate": "2018-09-01",
      "endDate": "2019-03-01",
      "summary": "At Event Farm, a marketing platform for event organizers, I contributed to the modernization and development of features for the web platform, including the frontend web client and backend API.",
      "highlights": [
        "Led the modernization of a legacy PHP 5 system, successfully transitioning it from an untested CakePHP 2.x monolith to a PHP 7 API and Angular Single Page Application. Achieved 85%+ code coverage to ensure robust and reliable functionality.",
        "Developed middleware client applications using [Golang](https://github.com/eventfarm/go-sdk) and [Node.js](https://github.com/eventfarm/javascript-sdk) to integrate with the Event Farm Rest API, including a custom event landing page builder that enhanced user experience and streamlined event management."
      ]
    },
    {
      "company": "Event Farm",
      "position": "Software Engineer",
      "website": "https://eventfarm.com",
      "startDate": "2016-02-01",
      "endDate": "2018-09-01",
      "highlights": [
        "Led the development of a Salesforce and Event Farm integration, streamlining attendee management. Open-sourced the [PHP 7 Salesforce Rest API](https://github.com/eventfarm/restforcephp) used for the integration, contributing to the developer community.",
        "Created auto-generating client libraries for the Event Farm API in multiple languages, including PHP, Typescript, Golang, Swift, and Java. Open-sourced the Typescript and Golang libraries on GitHub ([javascript-sdk](https://github.com/eventfarm/javascript-sdk) and [golang-sdk](https://github.com/eventfarm/go-sdk)) for improved system interoperability and efficiency.",
        "Maintained and improved a CakePHP API and AngularJS/Angular application, ensuring responsiveness and efficiency for enhanced user experience."
      ]
    },
    {
      "company": "Recovery Passport",
      "position": "Full Stack Web Developer",
      "website": "https://www.linkedin.com/company/recovery-passport/about/",
      "startDate": "2015-11-10",
      "endDate": "2017-04-26",
      "highlights": [
        "Designed and developed a web-based journaling system for alcohol and mental health recovery clinics, employing Laravel, MySQL, and Vue.js. Streamlined therapy processes and enhanced patient engagement.",
        "Sustained a Minimum Viable Product that served approximately 1,000 patients across multiple clinics in South Florida, demonstrating its real-world utility and positive impact on mental health recovery.",
        "Leveraged Docker for deployment on Digital Ocean, ensuring efficient application management and consistent runtime environment."
      ]
    },
    {
      "company": "__ Digital Canvas Design LLC",
      "position": "Owner / Consultant",
      "startDate": "2014-01-01",
      "endDate": "2020-05-01",
      "highlights": [
        "Designed and built [Recovery Passport](https://www.linkedin.com/company/recovery-passport/about/), a three-tiered recovery assistance system with counselors, members, and supporters, used by ~1000 alcohol and mental health recovery patients at several clinics around South Florida.",
        "Maintained custom web applications in PHP, Ruby, Nodejs, and Golang for clients with varying complexity.",
        "Provided infrastructure build out, web hosting, and custom server builds and installations."
      ]
    },
    {
      "company": "Web Services LLC",
      "position": "Full Stack Web Developer",
      "website": "https://www.linkedin.com/company/web-services-llc/about/",
      "startDate": "2014-06-01",
      "endDate": "2015-11-01",
      "summary": "At Web Services LLC, I created impactful embedded web applications for nationwide news stations, while also refining internal tools and a TV ad tracking service.",
      "highlights": [
        "Developed an analytics application for advertising agencies, correlating commercial airtime with customer response through web analytics, SMS, and social hashtags.",
        "Preserved and upgraded numerous PHP MVC applications and web scrapers, delivering essential services such as adopt-a-pet and restaurant inspections to local news stations using Laravel, CodeIgniter, and FuelPHP.",
        "Modernized WDIV Click on Detroit's 'Vote 4 the Best' voting application, transitioning from Laravel 3.x to Laravel 5.1 LTS, improving performance and maintainability."
      ]
    },
    {
      "company": "ACE Blueprinting & Graphics",
      "position": "Graphic Designer",
      "website": "https://aceblueprinting.com/",
      "startDate": "2011-05-01",
      "endDate": "2014-01-01",
      "summary": "At ACE Blueprinting & Graphics, a Ft. Lauderdale printing shop, I honed my design skills and delivered high-quality design solutions.",
      "highlights": [
        "Executed a range of graphic projects, taking responsibility for the full design lifecycle, from concept creation to the final print using Illustrator and Photoshop.",
        "Designed and assembled custom PC workstations to facilitate cutting-edge graphic editing and efficient print server operations for enhanced productivity."
      ]
    },
    {
      "company": "Florida Sea Grant",
      "position": "Web Developer - Contract",
      "website": "https://web.archive.org/web/20120621080013/http://www.sarasotabaysurvey.org/",
      "startDate": "2012-04-01",
      "endDate": "2012-07-01",
      "summary": "Collaborated with two Ph.D. candidates to gather data used for community research on the Sarasota Bay and the Ace Basin.",
      "highlights": [
        "Authored a PHP + jQuery + Google Maps-based interactive survey to gather data on the [Sarasota Bay](https://web.archive.org/web/20120621080013/http://www.sarasotabaysurvey.org/) in Florida and the [Ace Basin](https://web.archive.org/web/20130921231828/http://acebasinsurvey.org/) in South Carolina."
      ]
    },
    {
      "company": "Student Game Day LLC",
      "position": "Web Designer",
      "website": "https://web.archive.org/web/20080917053305/http://www.studentgameday.com/",
      "startDate": "2008-06-01",
      "endDate": "2009-12-01",
      "summary": "At Student Game Day, a tool for selling student college football tickets, I assisted in the design and HTML/CSS of a custom-built web app using procedural PHP.",
      "highlights": [
        "Contributed to the design and HTML/CSS of a custom-built web app for selling student college football tickets, built with procedural PHP."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Florida",
      "area": "Digital Media",
      "studyType": "Bachelor of Fine Arts",
      "endDate": "2013-08-01",
      "courses": [
        "Video Art",
        "Programming for Artists",
        "3D Modeling",
        "Game Design",
        "Color Theory",
        "Typography"
      ]
    }
  ],
  "publications": [
    {
      "name": "typescript-oauth2-server",
      "releaseDate": "2020-10-19",
      "website": "https://github.com/jasonraimondi/typescript-oauth2-server",
      "summary": "An implementation of an OAuth 2.0 authorization server for Node that utilizes JWT and Proof Key for Code Exchange (PKCE), written in TypeScript."
    },
    {
      "name": "promise-watch",
      "releaseDate": "2022-03-01",
      "website": "https://github.com/promise-watch/promise-watch",
      "summary": "An API/E2E monitor that runs promises on intervals and sends notifications on errors."
    },
    {
      "name": "url-to-png",
      "releaseDate": "2018-08-01",
      "website": "https://github.com/jasonraimondi/url-to-png",
      "summary": "Dynamic screenshots for the web over a simple HTTP API."
    },
    {
      "name": "traverse",
      "releaseDate": "2019-04-09",
      "website": "https://github.com/jasonraimondi/traverse",
      "summary": "Desktop app to explore trending GitHub repos (Mac OS/Linux)."
    }
  ],
  "skills": [
    {
      "name": "Frontend",
      "keywords": [
        "TypeScript",
        "JavaScript",
        "HTML5/CSS",
        "E2E Testing",
        "Unit Testing",
        "<Insert frontend framework here>"
      ]
    },
    {
      "name": "Backend",
      "keywords": [
        "Node.js",
        "Ruby",
        "PHP 7+",
        "E2E Testing",
        "Unit Testing",
        "OAuth",
        "Object-oriented programming",
        "Queues",
        "Relational databases",
        "Document databases",
        "Key-Value databases",
        "<Insert backend framework here>"
      ]
    },
    {
      "name": "Devops",
      "keywords": [
        "Kubernetes",
        "Terraform",
        "GitOps",
        "AWS",
        "Continuous Integration",
        "Continuous Deployment",
        "Autoscaling",
        "Docker"
      ]
    }
  ]
}
