{
  "basics": {
    "name": "Jason Raimondi",
    "label": "Software Engineer",
    "picture": "https://jasonraimondi.com/assets/misc/me/avatar.jpg",
    "email": "jason@raimondi.us",
    "phone": "(954) 703-0436",
    "website": "https://jasonraimondi.com/",
    "summary": "My name is Jason Raimondi and I am a Full Stack Software Engineer. My professional focus has been in web systems; everything from designing to building and deploying server and client web applications. What I really am is a technologist and all around computer geek. Give me a computer and I will be hacking in minutes, occupied for days.",
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "jasonraimondi",
        "url": "https://www.linkedin.com/in/jasonraimondi/"
      }
    ]
  },
  "work": [
    {
      "company": "Event Farm",
      "position": "Senior Software Engineer",
      "website": "https://eventfarm.com",
      "startDate": "2018-09-01",
      "endDate": "present",
      "summary": "Senior Software Engineer",
      "highlights": [
        "Test Drove the re-architecture of the API code base, decoupling the codebase from CakePHP 2.x, to a PHP 7 application built using Domain Driven Design based on CQS principles. The project is routed through Lumen and maintains over 85% code coverage.",
        "Authored middleware applications for internal and external projects in languages from Golang to Node.js and PHP, all independently deploy- able as separate working pieces to consuming our REST API."
      ]
    },
    {
      "company": "Event Farm",
      "position": "Software Engineer",
      "website": "https://eventfarm.com",
      "startDate": "2016-02-01",
      "endDate": "2018-09-01",
      "summary": "Software Engineer",
      "highlights": [
        "Headed the custom integrations between Event Farm and Salesforce, a market leading integration between the two platforms. A PHP interface to the Salesforce Rest API was built for the integrations and has been open sourced and made available on Github.",
        "Created auto generating API Client Libraries (SDK’s) for the Event Farm API in PHP, Typescript, Golang + Python. These libraries are dynamically generated by our CI tool, Jenkins."
      ]
    },
    {
      "company": "Digital Canvas Design LLC",
      "position": "Owner, Software Consultant",
      "startDate": "2014-01-01",
      "endDate": "present",
      "highlights": [
        "Managed web servers and applications for clients, historically built and deployed LAMP/LEMP stacks, currently bouncing between Golang, Node.js + PHP7.",
        "Deployed and secured Linux and BSD servers ranging from firewalls to webservers and NAS machines both internal and external.",
        "Constructs sites for clients with varying complexity, from simple static HTML websites, to custom built solutions using PHP + MySQL, utilizing existing web technologies including frameworks such as Laravel and CakePHP to CMS solutions such as WordPress."
      ]
    },
    {
      "company": "Freelancer",
      "position": "Professional Freelancer",
      "startDate": "2009-08-01",
      "endDate": "2014-01-01",
      "highlights": [
        "Utilized existing web technologies including WordPress, Laravel and Drupal for small businesses websites and artist portfolios.",
        "Video editing, closed captioning & subtitling, motion graphics.",
        "Custom computer builds, home theater setup, iPhone repair."
      ]
    },
    {
      "company": "Web Services LLC",
      "position": "Full Stack Web Developer",
      "startDate": "2009-08-01",
      "endDate": "2014-01-01",
      "highlights": [
        "Led team of 4 developers building AdStat, a SaaS Application for Advertising Agencies to monitor ROI and Reactions to TV Campaigns, integrating various web API’s including Google Analytics, Twilio, and Talkwalker.",
        "Key decision maker in choosing the web stack of our biggest project, AdStat. Decided upon a PHP, using Laravel as our base while utilizing both MySQL & MongoDB for data storage, and Foundation 5 for our front end.",
        "Headed the redesign of the WDIV Click on Detroit “Vote 4 the Best” voting application.",
        "Updated and optimized existing projects in PHP MVC frameworks including Laravel, Code Igniter, and FuelPHP.",
        "Assisted clients with various updates and changes to their websites, including WordPress, Magento, and custom built web apps.",
        "Maintained LEMP stack on a CentOS dedicated private server receiving anywhere from 10,000 to 1,000,000 daily requests."
      ]
    },
    {
      "company": "ACE Blueprinting & Graphics",
      "position": "Graphic Designer",
      "startDate": "2011-05-01",
      "endDate": "2014-01-01",
      "highlights": [
        "Designed and created graphics for banners, billboards, logos, and websites while communicating with clients to create projects from concept to finished, printed works. Projects ranged from large scale banners to business cards; designed vector and raster graphics using both Illustrator and Photoshop.",
        "Built several custom computers to serve as state of the art graphic editing stations and print servers."
      ]
    },
    {
      "company": "Florida Sea Grant (contract)",
      "position": "Front End Developer",
      "startDate": "2012-04-01",
      "endDate": "2012-07-01",
      "highlights": [
        "Coauthored a PHP + jQuery + Google Maps based interactive survey to gather data for two PhD students. The data was used to research community uses of the Sarasota Bay and the Ace Basin."
      ]
    },
    {
      "company": "Student Game Day LLC",
      "position": "Web Designer/Developer",
      "startDate": "2008-06-01",
      "endDate": "2010-12-01",
      "highlights": [
        "Collaborated on the front-end and design of a custom built web app using embaressingly old-school procedural PHP. A combination of Ticketmaster + Craigslist, for buying + sellinging student college football tickets."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Florida",
      "area": "Digital Media",
      "studyType": "Bachelor of Fine Arts",
      "endDate": "2013-08-01"
    }
  ],
  "skills": [
    {
      "name": "Front End",
      "keywords": [
        "TypeScript",
        "JavaScript",
        "(S)CSS",
        "React.js",
        "Vue.js",
        "Angular",
        "Electron",
        "Webpack"
      ]
    },
    {
      "name": "Back End",
      "keywords": [
        "Node.js",
        "Golang",
        "PHP",
        "TypeScript",
        "OOP",
        "RDS",
        "noSQL",
        "Firebase",
        "OAuth2",
        "REST",
        "Laravel",
        "Lumen",
        "Phalcon",
        "Doctrine"
      ]
    },
    {
      "name": "Ops",
      "keywords": [
        "Docker",
        "Docker Swarm",
        "Golang",
        "Python",
        "Debian",
        "Ubuntu",
        "ZFS",
        "PFSense",
        "LEMP/LAMP",
        "Nginx",
        "Traefik",
        "SSL",
        "Cron/Queues",
        "SQL"
      ]
    },
    {
      "name": "Design",
      "keywords": [
        "Photoshop",
        "Illustrator",
        "InDesign",
        "Premier Pro",
        "After Effects"
      ]
    }
  ]
}
